#Generated by Fabric Compiler ( version 2022.2-SP6.1 <build 138931> ) at Wed Jun 17 22:05:53 2026

add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/source/body.v"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/source/fifo_and_fmc.v"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/source/fmc.v"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/source/my_fifo.v"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/prj/project/ipcore/fifo/fifo.idf"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/prj/project/ipcore/pll/pll.idf"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/prj/project/ipcore/fifo/fifo.idf"
add_design "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/prj/project/ipcore/pll/pll.idf"
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
add_constraint "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/constraint/pin.fdc"
add_constraint "D:/fpga_stm32/fpga_stm_fmc/fpga_stm/fpga_pgl12g/constraint/timing.fdc"
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL12G -speedgrade -6 -package LPG144
compile -top_module body
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
